src/models/BusinessCustomersQuery.php

SELECT * FROM `business_customers` WHERE `customer_id`='120'
---
    public function one($db = null)
    {
        return parent::one($db);