src/models/CitiesStatesQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `cities_states`