src/models/FullProductsQuery.php

SELECT * FROM `full_products` WHERE `product_id`='13'
---
    public function all($db = null)
    {
        return parent::all($db);