src/models/HomeCustomersQuery.php

    public function one($db = null)
    {
        return parent::one($db);
---
SELECT * FROM `home_customers` WHERE `customer_id`='120'