src/models/ManageStoresQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `manage_stores` WHERE `store_id`=1