src/models/ProductsColorsQuery.php

SELECT * FROM `products_colors` ORDER BY `product_id`
---
    public function all($db = null)
    {
        return parent::all($db);