src/models/RegionsQuery.php

SELECT * FROM `regions` ORDER BY `region_id`
---
    public function all($db = null)
    {
        return parent::all($db);

SELECT * FROM `regions` WHERE `region_id`=1
---
    public function one($db = null)
    {
        return parent::one($db);