src/models/SalespersonsQuery.php

SELECT * FROM `salespersons`
---
    public function all($db = null)
    {
        return parent::all($db);