src/models/StoresQuery.php

SELECT * FROM `stores` ORDER BY `store_id`
---
    public function all($db = null)
    {
        return parent::all($db);

SELECT * FROM `stores` WHERE `store_id`=1
---
    public function one($db = null)
    {
        return parent::one($db);