src/models/Users.php

public static function findByUsername($username) {
    $dbUser = DbUser::find()
            ->where([
                "username" => $username
            ])
            ->one();
---
SELECT * FROM `users` WHERE `username`='mharbi@me.com'